zigzig159/smt32-workspace/stm32g431_fw/Core/Src/driver/ili9341/ili9341_GFX.h
/*
 * ili9341_GFX.h
 *
 *  Created on: Sep 10, 2025
 *      Author: RND1
 */

#ifndef SRC_DRIVER_ILI9341_ILI9341_GFX_H_
#define SRC_DRIVER_ILI9341_ILI9341_GFX_H_

#include "stm32g4xx_hal.h"

#define HORIZONTAL_IMAGE  0
#define VERTICAL_IMAGE    1

void ILI9341_Draw_Hollow_Circle(uint16_t X, uint16_t Y, uint16_t Radius, uint16_t Colour);
void ILI9341_Draw_Filled_Circle(uint16_t X, uint16_t Y, uint16_t Radius, uint16_t Colour);
void ILI9341_Draw_Hollow_Rectangle_Coord(uint16_t X0, uint16_t Y0, uint16_t X1, uint16_t Y1, uint16_t Colour);
void ILI9341_Draw_Filled_Rectangle_Coord(uint16_t X0, uint16_t Y0, uint16_t X1, uint16_t Y1, uint16_t Colour);
void ILI9341_Draw_Char(char Character, uint8_t X, uint8_t Y, uint16_t Colour, uint16_t Size, uint16_t Background_Colour);
void ILI9341_Draw_Text(const char* Text, uint8_t X, uint8_t Y, uint16_t Colour, uint16_t Size, uint16_t Background_Colour);
void ILI9341_Draw_Filled_Rectangle_Size_Text(uint16_t X0, uint16_t Y0, uint16_t Size_X, uint16_t Size_Y, uint16_t Colour);

//USING CONVERTER: http://www.digole.com/tools/PicturetoC_Hex_converter.php
//65K colour (2Bytes / Pixel)
void ILI9341_Draw_Image(const char* Image_Array, uint8_t Orientation);

#endif /* SRC_DRIVER_ILI9341_ILI9341_GFX_H_ */
